In [1]:
#算术运算 数据对齐
import numpy as np
import pandas as pd

In [3]:
s1 = pd.Series(np.arange(4),index=['a','b','c','d'])
s2 = pd.Series(np.arange(5),index=['a','c','e','d','f'])
s1+s2

a    0.0
b    NaN
c    3.0
d    6.0
e    NaN
f    NaN
dtype: float64

In [4]:
#df
df1 = pd.DataFrame(np.arange(12).reshape(4,3),index=['a','b','c','d'],columns=list('ABC'))
df2 = pd.DataFrame(np.arange(9).reshape(3,3),index=['a','d','f'],columns=list('ABD'))
df1

   A   B   C
a  0   1   2
b  3   4   5
c  6   7   8
d  9  10  11

In [5]:
df2

   A  B  D
a  0  1  2
d  3  4  5
f  6  7  8

In [6]:
df1+df2

      A     B   C   D
a   0.0   2.0 NaN NaN
b   NaN   NaN NaN NaN
c   NaN   NaN NaN NaN
d  12.0  14.0 NaN NaN
f   NaN   NaN NaN NaN

In [7]:
#使用填充值的算数
s1

a    0
b    1
c    2
d    3
dtype: int32

In [8]:
s2

a    0
c    1
e    2
d    3
f    4
dtype: int32

In [9]:
s1.add(s2,fill_value = 0)

a    0.0
b    1.0
c    3.0
d    6.0
e    2.0
f    4.0
dtype: float64

In [10]:
df1.add(df2,fill_value=0)

      A     B     C    D
a   0.0   2.0   2.0  2.0
b   3.0   4.0   5.0  NaN
c   6.0   7.0   8.0  NaN
d  12.0  14.0  11.0  5.0
f   6.0   7.0   NaN  8.0

In [11]:
df1.rdiv(1)# = 1/df1

          A         B         C
a       inf  1.000000  0.500000
b  0.333333  0.250000  0.200000
c  0.166667  0.142857  0.125000
d  0.111111  0.100000  0.090909

In [13]:
df1.reindex(columns=df2.columns,fill_value = 9) #df1没有D这一列 然后用9填充

   A   B  D
a  0   1  9
b  3   4  9
c  6   7  9
d  9  10  9

In [14]:
#df和s的混合运算
arr = np.arange(12).reshape(4,3)
arr

array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 9, 10, 11]])

In [17]:
df1

   A   B   C
a  0   1   2
b  3   4   5
c  6   7   8
d  9  10  11

In [15]:
arr-arr[0]

array([[0, 0, 0],
       [3, 3, 3],
       [6, 6, 6],
       [9, 9, 9]])

In [16]:
s3 = df1.iloc[0]
s3

A    0
B    1
C    2
Name: a, dtype: int32

In [18]:
df1-s3#按照行广播

   A  B  C
a  0  0  0
b  3  3  3
c  6  6  6
d  9  9  9

In [19]:
s4 = df1['A']
s4

a    0
b    3
c    6
d    9
Name: A, dtype: int32

In [21]:
df1.sub(s4,axis=0)

   A  B  C
a  0  1  2
b  0  1  2
c  0  1  2
d  0  1  2